In [1]:
import pandas as pd
import numpy as np

In [2]:
columns=["Name", "Age","Gender"]
dict1={
    "Name":["Ahmad","Yasser","Mohamed","Raafat","Zaki","Eyad","Khaled","Ali","Moaz","Tamer"], 
    "Age":[22,18,15,22,30,21,20,19,35,23],
    "ID":[i for i in range(10)]
}

In [ ]:
data='float16'
print(f'{np.finfo(data).min} to {np.finfo(data).max}')

In [3]:
df=pd.DataFrame(dict1)
df

      Name  Age  ID
0    Ahmad   22   0
1   Yasser   18   1
2  Mohamed   15   2
3   Raafat   22   3
4     Zaki   30   4
5     Eyad   21   5
6   Khaled   20   6
7      Ali   19   7
8     Moaz   35   8
9    Tamer   23   9

In [4]:
#Task 4: How to read random rows

#to select random rows
df2=pd.DataFrame(dict1).sample(n = 3) #n: number of rows
df2

     Name  Age  ID
6  Khaled   20   6
8    Moaz   35   8
5    Eyad   21   5

In [5]:
#Randomly select a specified fraction of the total number of rows. Set frac=0.50, a random selection of 50% of the total rows
df3=pd.DataFrame(dict1).sample(frac=0.5) 
df3

      Name  Age  ID
9    Tamer   23   9
8     Moaz   35   8
2  Mohamed   15   2
0    Ahmad   22   0
1   Yasser   18   1

In [6]:
#Task 5:Save 2 columns last 3 rows

df[["Name","Age"]].iloc[-3:].to_csv("newdata.csv", index=True)

In [7]:
#Task 6: How to append on a csv or excel sheet 
df2.to_csv("newdata.csv", index=False,mode='a' ,header=False) #set mode to 'a'

TypeError: to_excel() got an unexpected keyword argument 'mode'